app/controllers/temporary_reports_controller.rb

  def index
   	@q = SearchParams.new(params[:search_params] || {})
    search_params = @q.attributes(self)
    # 辅助工具报表
    test_report = params[:report_type] == "test" ? "and report_type = 10" : "and report_type != 10"
    @reports = TemporaryReport.default_where(search_params).where("parent_id < 1 #{test_report} ").order(id: :desc).page(params[:page]).per(20)
---
SELECT  `temporary_reports`.* FROM `temporary_reports` WHERE (parent_id < 1 and report_type != 10 ) ORDER BY `temporary_reports`.`id` DESC LIMIT 20 OFFSET 0

  def create
    TemporaryReport.transaction do
      @temporary_report = TemporaryReport.new(report_params)
      params[:temporary_report][:report_condition].each do |index, spec|
        if spec[:report_key].present?
          @temporary_report.report_conditions.new(spec.permit!)
        end
      end
      if params[:parent_report]
        @temporary_report.parent_id = -1
        @temporary_report.report_type = 1
      end
      @temporary_report.save
---
INSERT INTO `report_conditions` (`temporary_report_id`, `name`, `report_key`, `report_condition`, `created_at`, `updated_at`, `default_value`) VALUES (1, '开始时间', 'start_time', '  \'#{@start_time}\' ', '2017-07-21 17:51:02', '2017-07-21 17:51:02', '2017-07-20 17:50:16 +0800')
INSERT INTO `temporary_reports` (`name`, `base_sql`, `note`, `columns`, `head_html`, `created_at`, `updated_at`, `jump_links`) VALUES ('test', 'select * from employees ', '', 'name email', '', '2017-07-21 22:49:14', '2017-07-21 22:49:14', '')

  def update
    TemporaryReport.transaction do
      @temporary_report.update(report_params)
      params[:temporary_report][:report_condition].each do |index, spec|
        spec.permit!
        if spec[:id].present?
          new_spec = ReportCondition.find(spec[:id])
          new_spec.attributes =  spec
          new_spec.save
        elsif spec[:report_key].present?
          new_spec = @temporary_report.report_conditions.new(spec)
          new_spec.save
        end
      end
      if params[:parent_report]
        params[:parent_report][:columns].each_with_index do |report,i|
          parent_report = params[:parent_report].keys.inject({}){|o,j| o[j] = params[:parent_report][j][i] ; o }
          report = parent_report["id"] ? TemporaryReport.find(parent_report["id"].to_i) : TemporaryReport.new
---
UPDATE `temporary_reports` SET `columns` = '门店名	询盘数	报价数	下单数	cas数量	采购额	毛利	毛利率	销售额	销售单数	上传产品数量	收到的询盘数	给出的报价数1', `updated_at` = '2017-07-21 17:59:44' WHERE `temporary_reports`.`id` = 1
SELECT  `report_conditions`.* FROM `report_conditions` WHERE `report_conditions`.`id` = 1 LIMIT 1
SELECT  `temporary_reports`.* FROM `temporary_reports` WHERE `temporary_reports`.`id` = 1 LIMIT 1

  def chart_report
    if @temporary_report.temporary_charts.present?
      @temporary_chart = @temporary_report.temporary_charts.first
    else
      @temporary_chart = TemporaryChart.new(temporary_report_id:@temporary_report.id)
    end
    if params[:temporary_chart]
      @temporary_chart.update(chart_report_params)

      if params[:parent_chart]
        params[:parent_chart][:y_axis].each_with_index do |chart,i|
          parent_chart = params[:parent_chart].keys.inject({}){|o,j| o[j] = params[:parent_chart][j][i] ; o }
          chart = parent_chart["id"] ? TemporaryChart.find(parent_chart["id"].to_i) : TemporaryChart.new
          chart.assign_attributes(parent_chart.merge(parent_id:@temporary_chart.id , chart_type:@temporary_chart.chart_type , temporary_report_id:@temporary_chart.temporary_report_id ))
          chart.save
---
SELECT `temporary_charts`.* FROM `temporary_charts` WHERE `temporary_charts`.`temporary_report_id` = 16
INSERT INTO `temporary_charts` (`temporary_report_id`, `y_axis`, `chart_data`, `note`, `created_at`, `updated_at`) VALUES (1, 'a1,a2,a3,a4,a5,a6,a7', '', '总门店粒度图表', '2017-07-21 17:58:56', '2017-07-21 17:58:56')

  def report
    return @message = "很抱歉，您还没有该报表的权限，请联系管理员。" unless @temporary_report.employee_ids.include?(current_employee.id) || current_employee.admin?

    # 解析下载excell参数
    if params[:report_params].present?
     params[:search_params] = params[:report_params]
     # 纯粹的判断条件但又没有作为查询条件
        @temporary_report.report_conditions.each do |c|
---
SELECT `employees`.id FROM `employees` INNER JOIN `employees_temporary_reports` ON `employees`.`id` = `employees_temporary_reports`.`employee_id` WHERE `employees_temporary_reports`.`temporary_report_id` = 14
SELECT `report_conditions`.* FROM `report_conditions` WHERE `report_conditions`.`temporary_report_id` = 14

  def set_report
    @temporary_report = TemporaryReport.find(params[:id])
---
SELECT  `temporary_reports`.* FROM `temporary_reports` WHERE `temporary_reports`.`id` = 16 LIMIT 1